// © Copyright 2011-2013, 2015-2016 HP Development Company, L.P.

TaskName = "无线设置";
TaskTOCTitle = "HP 自动无线连接";
ConfirmSettingsTaskName = "确认 HP 自动无线连接";
ConfirmSettingsTaskTOCTitle = "确认无线设置";
NetworkSelectTaskName = "选择网络";
DeviceDiscoveryTaskName = "选择设备";
DeviceDiscoveryTaskTitle = "选择要配置的设备";
ConfigureSettingsTaskName = "正在配置设备";
ResultsTaskName = "配置结果";

// confirmation pane
ConfirmationDescriptionText = "如果选择使用 HP 自动无线连接，那么电脑将暂时与您的无线网络断开连接，因此您应该首先完成进行中的所有下载/上传工作。此中断可能持续约 30 秒，此后无线网络将恢复正常。";
HostNetworkDetectedTitle = "应用程序检测到您的计算机已经通过以下设置来连接到无线网络:";
WirelessNetworkNameTitle = "无线网络名称:";
CommunicationModeTitle = "通信模式:";
EncryptionTypeTitle = "加密类型:";

WirelessNetworkChooseTitle = "是否希望将您的设备配置为使用以上设置?";
KeepCurrentNetworkSettingsTitle = "是，保持这些设置。";
ChooseAnotherNetworkSettingsTitle = "否，我想选择其他网络。";
ShowSettingsTitle = "显示设置";

// network selection pane
NetworkSelectTitle = "请从下面列表中选择无线网络名称。";
SelectedNetworkPasswordTitle = "密码:";
NetworkSelectContinueDescription= "点按继续以将设备添加到\"%@\"。";
NetworkDiscoveryFailedTitle = "网络发现失败";
NetworkDiscoveryFailedDescription = "没有发现无线网络。";
SetupNetworkSelectedTitle = "选择其他网络";
SetupNetworkSelectedDescription = "您正在尝试连接到打印设备所创建的特殊网络。请单击“确定”，然后选择其他网络。";

NetworkNotAvailableTitle = "网络不可用";
DeviceNetworkNotAvailableMessageFormat = "设备无法访问无线网络 \"%@\"。请确保无线访问点运作正常，且在您设备范围内，也可以选择其他网络。";
MacNetworkNotAvailableMessageFormat = "MAC 无法访问无线网络 \"%@\"。请确保您的无线访问点正常运行，并且处于您的 MAC 的范围内，或者选择另一个网络。";
ChangeNetworkButtonTitle= "更改网络";

LookingForNetworkMessageFormat = "正在查找网络:\"%@\"";

UnsupportedNetworkTitle = "不受支持的网络";
UnsupportedNetworkMessageFormat = "请选择其他网络或联系网络管理员获取帮助。";

EnterpriseNetworkAlertTitle = "已选定企业网络";
EnterpriseNetworkAlertForUSBConnectionMessage = "此网络已使用某种类型的企业加密功能进行安全保护。请将打印机连接到您的计算机所在的同一网络，然后使用嵌入式 Web 服务器，或者联系您的管理员。";
EnterpriseNetworkAlertForNetworkConnectionMessage = "此网络已使用某种类型的企业加密功能进行安全保护。要将打印机连接到此网络，请使用嵌入式 Web 服务器 (EWS)，或者联系您的管理员。如果您选择使用 EWS，那么您的计算机将与无线网络断开连接，并连接到一个打印机创建的特殊网络中。";
ConfigureUsingEWSButtonTitle = "使用 EWS 进行配置";
ConnectingToDeviceProgressTitle = "正在连接到设备网络...";

UnableToConnectToDeviceNetworkAlertMessage = "确保设备能够在这台电脑上看到，设备上的蓝色指示灯闪烁，表明设备处于 HP 自动无线直接模式。您可以使用设备控制面板上的恢复网络默认值选项重置这种模式。具体操作步骤请参考设备的说明文档。";

// select device
DeviceNameColumnTitle = "设备名";
DeviceModelColumnTitle = "设备型号";
AllFilterTitle = "全部";
DevicesFilterLabel = "设备:";
SupportedDevicesFilterTitle = "支持";

// configure
ConfigureTaskName = "正在配置您的 HP 设备";
ConfigureTitle = "正在配置…";
NoteTitle = "正在为您的 HP 设备配置无线网络。这可能需要几分钟时间。";
RestoringNetworkSettings = "正在恢复网络设置…";

// particular errors
IncorrectPasswordTitle = "密码未被接受";
IncorrectPasswordDescription = "无线网络\"%@\".\n\n不接受该密码。\n\n请重新输入密码。";

DuplicateNetworkNameErrorTitle = "WiFi 网络名称重复";
DuplicateNetworkNameErrorDescription = "检测到重复的\"%@\"WiFi 网络。请检查无线路由器设置。";

MacAddressFilterErrorTitle = "WiFi 过滤器错误";
MacAddressFilterErrorDescription = "设备 MAC 硬件地址已过滤掉，无法从\"%@\"中获取。请检查无线路由器设置。";

WeakSignalStrengthErrorTitle = "信号强度弱";
WeakSignalStrengthErrorDescription = "\"%@\"无线路由器信号强度弱。请将设备放到更靠近路由器的位置。";

DeviceNotReachableErrorTitle = "无法访问设备";
DeviceNotReachableErrorDescription = "已将无线网络设置成功下载到您的设备。但是，您的 Mac 找不到网络上的设备。\n\n请确保以下各项:\n• 您的 Mac 连接到有线或无线网络，以访问您的设备。\n• 您的设备连接到无线网络 \"%@\"。";

EmptyPasswordError = "需要密码。";
TooShortWPAPersonalPasswordError = "密码必须至少为 8 个字符。";
TooLongWPAPersonalPasswordError = "密码长度不能超过 64 个字符。";

// restore original network errors

FailedToRestoreOriginalNetworkErrorTitle = "无法还原与初始无线网络的连接";

NoPasswordIsStoredInKeychainErrorMessageFormat = "助理无法从您的钥匙串中检索无线网络“%@”的凭据。请确保您的 Mac 已连接到您的设备能够访问的有线或无线网络。";
PasswordFromKeychainNotAcceptedErrorMessageFormat = "无线网络“%@”未接受您的凭据。请确保您的 Mac 已连接到您的设备能够访问的有线或无线网络。";
FailedToRestoreOriginalNetworkGenericErrorMessage = "请确保您的无线访问点能够正常工作，并且您的 Mac 在其覆盖范围之内，然后尝试手动建立连接。";

// results
ManualNetworkConfigurationTitle = "手动";
AutoNetworkConfigurationTitle = "自动";
LinklocalNetworkConfigurationTitle = "本地链路";
NetworkSettingsTitle = "网络设置";
ConfigurationFailedTaskName = "配置失败";
ConfigurationCompleteTaskName = "配置完成";
ConfigurationFailedTitle = "助手无法使用无线连接配置您的设备。";
ConfigurationSucceededTitle = "您的 HP 设备现已正确配置，并已加入 \"%@\"网络。";

ConfigurationFailedNote = "请确保无线接入点能够正常工作，您的设备在其范围内并已开启且空闲，然后单击“重试”以再次尝试。\n\n%@";
UnableToConnectToDeviceNetworkUSBSOWMessage = "确保设备已经打开，能够在这台电脑上看到，然后点击重试，再次尝试。这时设备上的蓝色指示灯会闪烁，表明设备处于 HP 自动无线直接模式。安装后第一次启动时，设备将维持这种模式 1 小时，直到连接上网络。\n\n%@";
UnableToConnectToDeviceNetworkFPWithoutIndicatorSOWMessage = "确保您的设备在此计算机的查看范围内且处于 HP 自动无线连接模式下，然后单击“重试”再次尝试。您可以使用设备控制面板上的“还原网络默认值”选项重置 HP 自动无线连接模式。请参阅设备文档，了解有关执行此操作的说明。\n\n%@";
UnableToConnectToDeviceNetworkFPWithIndicatorSOWMessage = "确保设备能够在这台电脑上看到，设备上的蓝色指示灯闪烁，表明设备处于 HP 自动无线直接模式。安装后第一次启动时，设备将维持这种模式 1 小时，直到连接上网络。然后点击重试，再次尝试。您可以使用设备控制面板上的恢复网络默认值选项重置 HP 自动无线直连模式。具体操作步骤请参考设备的说明文档。\n\n%@";
ConfigurationFailedUSBSOWPart = "或者，您也可以使用 USB 电缆将您的设备连接到此计算机, 然后单击“重试”以配置您的设备。将设备配置好以加入您之前选择的网络之后，您可以断开它与计算机的连接。";
ConfigurationFailedFPSOWPart = "或者，您也可以使用无线设置向导配置您的设备以连接到无线网络，可通过设备上的控制面板访问无线设置向导。为此，请执行以下步骤:
       1. 按设备上的“无线”按钮或点击“无线”图标。
       2. 在设备的显示屏上，打开无线状态屏幕并选择“设置”。
       3. 选择“无线设置向导”并按照屏幕上的说明操作。


成功完成此向导后，您的设备会自动连接到网络。";

ConfigurationOverUSBFailedTitle = "助手无法使用 USB 连接配置您的设备。";
ConfigurationOverUSBFailedNote = "请确保无线接入点能够正常工作，您的设备在其范围内并已开启且空闲，然后单击“重试”以再次尝试。";
MoreInfoText = "若要在线获得详细信息，请访问";
FailedTitle = "检索网络信息失败";
BonjourServiceNameLabel = "Bonjour 服务名称:";
IPAddress = "IP 地址:";
AddressMode = "地址模式:";
SubnetMask = "子网掩码:";
DefaultGateway = "默认网关:";
HostName = "主机名:";
PrefixLength = "前缀长度:";
DisconnectUSBWarningText = "<b>重要:</b> 请断开当前连接到您的设备的 USB 电缆。";
DeviceNotLocatedWarningText = "无线网络设置已成功下载到您的设备。但是，您的 Mac 在网络上找不到该设备。";

// network settings
Adhoc = "Adhoc";
Infrastructure = "基础设施";

// select network
NetworkColumnTitle = "网络";
SignalStrengthColumnTitle = "信号强度";
EncryptionColumnTitle = "加密";
ModeColumnTitle = "模式";
